Tekla Open API Reference for Tekla Structures 2025
ErrorDialog.Show Method (String, List<String>, ErrorDialog.Severity)
 Shows a new error dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void Show(
	string Message,
	List<string> Details,
	ErrorDialog.Severity Severity
)
Public Shared Sub Show (
	Message As String,
	Details As List(Of String),
	Severity As ErrorDialog.Severity
)
Parameters
Message
Type: System.String
The message to display in the dialog.
Details
Type: System.Collections.Generic.List<String>
The details to display in the dialog.
Severity
Type: Tekla.Structures.Dialog.ErrorDialog.Severity
The severity of the message.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the Message parameter is null.
See Also
Reference
ErrorDialog Class
Show Overload
Tekla.Structures.Dialog Namespace